In [72]:
import pandas as pd

In [73]:
data = [1,2,3,4,5,10]

In [74]:
type(data)

list

In [75]:
series = pd.Series(data)

In [76]:
series

0     1
1     2
2     3
3     4
4     5
5    10
dtype: int64

In [77]:
type(series)

pandas.core.series.Series

In [78]:
df = pd.DataFrame(series)

In [79]:
df

    0
0   1
1   2
2   3
3   4
4   5
5  10

In [80]:
#set the name of columns
df.columns=['number']

In [81]:
df

   number
0       1
1       2
2       3
3       4
4       5
5      10

In [82]:
data = [[1,2] , [4,5], [7,5]]

In [83]:
data

[[1, 2], [4, 5], [7, 5]]

In [84]:
df1 = pd.DataFrame(data)

In [85]:
df1

   0  1
0  1  2
1  4  5
2  7  5

In [86]:
df1.columns = ['num1','num2']

In [87]:
df1

   num1  num2
0     1     2
1     4     5
2     7     5

In [88]:
s = df1[['num1','num2']]
print(s)

   num1  num2
0     1     2
1     4     5
2     7     5

# Dictionary to Series and DataFrame

In [89]:
#create a Dictionary
dic = {
    'Name' : ["Mahmudul" , ' Shawon' , 'Shakil' ],
    'Ages' : [18,18,25],
    'city': ['Erlangen', 'Nuremburg', 'Munich']
    
}

In [90]:
dic

{'Name': ['Mahmudul', ' Shawon', 'Shakil'],
 'Ages': [18, 18, 25],
 'city': ['Erlangen', 'Nuremburg', 'Munich']}

In [91]:
df = pd.DataFrame(dic)

In [92]:
df

       Name  Ages       city
0  Mahmudul    18   Erlangen
1    Shawon    18  Nuremburg
2    Shakil    25     Munich

In [93]:
# Create a Series from the dictionary
name_series = pd.Series(df['Name'])
name_series

0    Mahmudul
1      Shawon
2      Shakil
Name: Name, dtype: object

In [94]:
df.Name

0    Mahmudul
1      Shawon
2      Shakil
Name: Name, dtype: object

In [95]:
df.Ages

0    18
1    18
2    25
Name: Ages, dtype: int64

#  Set to Series and DataFrame

In [96]:
#create a set

In [97]:
s = {1,2,3,5,6,3}

In [98]:
s  # (3 two time but set can't allow duplicate value)

{1, 2, 3, 5, 6}

In [99]:
df = pd.Series(tuple(s))

In [100]:
df

0    1
1    2
2    3
3    5
4    6
dtype: int64

In [101]:
df = pd.DataFrame(tuple(s),columns=['num1'])

In [102]:
df

   num1
0     1
1     2
2     3
3     5
4     6

In [103]:
df.columns = ['number']

In [104]:
df

   number
0       1
1       2
2       3
3       5
4       6

# Tuple to Series and DataFrame

In [105]:
#create a tuple

In [106]:
tup = (1,2,3,3,4,45,5)

In [107]:
df = pd.Series(tup)

In [108]:
df

0     1
1     2
2     3
3     3
4     4
5    45
6     5
dtype: int64

In [109]:
df1 = pd.DataFrame(tup,columns=['number'])

In [110]:
df1

   number
0       1
1       2
2       3
3       3
4       4
5      45
6       5

In [115]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   number  7 non-null      int64
dtypes: int64(1)
memory usage: 188.0 bytes

 # Creating a DataFrame with integer data

In [116]:
# Creating a DataFrame with integer data
data = {'Age': [25, 30, 26, 28, 20, 22, 40, 28], 
        'Salary': [50000, 65000, 45000, 67000, 32000, 48000, 80000, 56000]}
df = pd.DataFrame(data)
df

   Age  Salary
0   25   50000
1   30   65000
2   26   45000
3   28   67000
4   20   32000
5   22   48000
6   40   80000
7   28   56000

In [118]:
df.info() #260 bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int64
 1   Salary  8 non-null      int64
dtypes: int64(2)
memory usage: 260.0 bytes

In [119]:
#change the data type int64 to int32

In [121]:
df['Age'] = df['Age'].astype('int32')

In [123]:
df.info() # memory usage: 228.0 bytes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     8 non-null      int32
 1   Salary  8 non-null      int64
dtypes: int32(1), int64(1)
memory usage: 228.0 bytes

In [127]:
import numpy as np

In [130]:
np.power(32,2)

1024

In [133]:
# Create a list of dates
dates = ['2023-10-04', '2024-11-15', '2025-01-01']

dates

['2023-10-04', '2024-11-15', '2025-01-01']

In [134]:
type(dates)

list

In [135]:
df = pd.DataFrame(dates)

In [136]:
df

            0
0  2023-10-04
1  2024-11-15
2  2025-01-01

In [137]:
type(df)

pandas.core.frame.DataFrame

In [141]:
df1 = pd.DataFrame(dates)

In [142]:
df1

            0
0  2023-10-04
1  2024-11-15
2  2025-01-01